---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConfiguration
source: html/2689f5d9-ec0c-2831-5212-09025edc1611.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData.FlowConfiguration Property

The flow configuration mode of the pipe.

## Syntax (C#)
```csharp
public PipeFlowConfigurationType FlowConfiguration { get; }
```